Revit 2026 API

# RailAngledJoinOption Enumeration

---

The angled joins of the rails.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RailAngledJoinOption
```
```vb
Public Enumeration RailAngledJoinOption
```
```cpp
public enum class RailAngledJoinOption
```
```fsharp
type RailAngledJoinOption
```

| Member name | Value | Description |
| --- | --- | --- |
| AddVerticalOrHorizontalSegments | 0 | Add vertical or horizontal segments. |
| NoConnector | 1 | No connector. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace